[
{"body": "<p>Monday, June 20, 2016, Reading, PA – Reading Area Community College (RACC) has entered into an agreement outlining clear pathways for students who will pursue bachelor of arts with Lycoming College, Williamsport, Pennsylvania.</p><p>Students will benefit from taking advantage of this agreement: </p><ul> <li>The Associate of Arts in Liberal Arts or Social Science with a concentration in anthropology will transfer seamlessly into Lycoming’s bachelor degree programs.</li> <li>Application fee is waived.</li> <li>Students can earn up to $24,000 in scholarships based on their GPA.</li> <li>Phi Theta Kappa honor society members are eligible to receive $1,000 over and above a Lycoming College awarded merit scholarship.</li> <li>Honors graduates who hold a 3.5 GPA are guaranteed admittance to Lycoming’s Scholars Program.</li> </ul> <p>Lycoming is ranked as a Tier 1 National Liberal Arts and Sciences college by U.S. News &amp; World Report. In addition, Lycoming is listed as one of “The Best Northeastern Colleges” by The Princeton Review and one of “America’s Best Colleges” by Forbes.com</p> <p>Because RACC’s Honors Program is an incubator for developing creative and intellectually curious students, Lycoming College is a perfect fit for RACC’s Honors graduates. Moreover, RACC has a robust selection of honors courses in social sciences and specifically anthropology due to Dr. Pamela Blakely, Anthropology Professor and Honors Coordinator. Dr. Blakely explains, \"We have very talented students in our Honors Program. Our goal is to help these students sharpen their intellectual skills in a stimulating and nurturing environment, so they are prepared to excel at their transfer colleges and universities such as Lycoming.\"</p> <p>Dr. Anna Weitz, RACC president, is excited for this partnership. Her own career in higher education started at Lycoming and friends of the College are Lycoming alumni. Jodi Corbett, Director of Academic Partnerships, explains, “Such agreements reflect the importance of champions and relationships. Lycoming was thrilled to work with us and to help us put together an agreement that provides students with opportunity to earn their bachelor degree from a top liberal arts school.”</p> <p>For more information contact Jodi Corbett, Director of Academic Partnerships, at 610-607-6219, or <a href=\"mailto:jcorbett@racc.edu\" target=\"_blank\">jcorbett@racc.edu</a></p>", "excerpt": "Monday, June 20, 2016, Reading, PA – Reading Area Community College (RACC) has entered into an agreement outlining clear pathways for students who will pursue bachelor of arts with Lycoming College, Williamsport, Pennsylvania.", "id": 1, "title": "Articulation Agreement Signed with Lycoming College"},
{"body": "<p>As a RACC graduate, your input is very important in helping us better understand and address the needs and concerns of our student body. Please complete this graduate follow-up survey:</p>", "excerpt": "As a RACC graduate, your input is very important in helping us better understand and address the needs and concerns of our student body. Please complete this graduate follow-up survey:", "id": 2, "title": "RACC Graduate Survey 2014 - 2015"},
{"body": "<p>Monday, April 4, 2016, Reading, PA – Thirty-seven Reading Area Community College students have distinguished themselves academically and were inducted into the Alpha Sigma Rho chapter of Phi Theta Kappa during a ceremony on Friday, Apr. 1 in the Schmidt Training and Technology Center. Phi Theta Kappa is the international honor society for two-year colleges.</p><p>To be eligible for membership in Phi Theta Kappa, students must: </p><ul> <li>Be enrolled in a regionally accredited institution offering an associate degree program.</li> <li>Have completed at least 12 hours of coursework leading to an associate degree program.</li> <li>Generally have a grade point average of 3.6.</li> <li>Receive an invitation to membership from the chapter at the college where presently enrolled.</li> </ul> <p>For more information contact <a href=\"mailto:dsingleton@racc.edu\">Dr. Donna Singleton</a>, Phi Theta Kappa Advisor, at 610-372-4721, ext. 5096.</p> <p><strong>Spring 2016 Inductees</strong> </p><ul> <li>Kari Amidon-Ide, Sinking Spring</li> <li>Christopher Argot, Bernville</li> <li>Katelyn Bennett, Reading</li> <li>Victoria Bernhart, Leesport</li> <li>Rachel Chlebowski, Reading</li> <li>Rachael Clineff, Douglassville</li> <li>Angie Deibler, Reading</li> <li>Alex Diego, Reading</li> <li>Dawn Eddinger, Birdsboro</li> <li>Jared Fetterman, Morgantown</li> <li>Dean Ficarro, Fleetwood</li> <li>Annie Greene, Birdsboro</li> <li>Jessica Grim, West Lawn</li> <li>Francheska Guzman, Reading</li> <li>John Howe, Bernville</li> <li>Alexis Kerscher, Blandon</li> <li>Briana Knight, Hamburg</li> <li>Daniel Kreiner, Reading</li> <li>Kathryn Lancenese, Alburtis</li> <li>Samantha Leck, Fleetwood</li> <li>Michael Lill, Birdsboro</li> <li>Yaroslava Lutso, Sinking Spring</li> <li>Hannah Martin, Mohnton</li> <li>Afaf Maslah, Reading</li> <li>Jennifer McElrea, Fleetwood</li> <li>Brett Meeks, Mohnton</li> <li>Gregory Miller, Reading</li> <li>Kevin Moriarty, Douglassville</li> <li>Heather Murray, Sinking Spring</li> <li>Jose Rodriguez, Reading</li> <li>Erin Sheets, Wernersville</li> <li>Samantha Speiss, Wyomissing</li> <li>Jeremy Stalter, Reading</li> <li>Jessica Vera, Reading</li> <li>Kristy Whitekettle, Reading</li> <li>Melisa Williamson Mohnton</li> <li>Daniel Young, Douglassville</li> </ul>", "excerpt": "Monday, April 4, 2016, Reading, PA – Thirty-seven Reading Area Community College students have distinguished themselves academically and were inducted into the Alpha Sigma Rho chapter of Phi Theta Kappa during a ceremony on Friday, Apr. 1 in the Schmidt Training and Technology Center. Phi Theta Kappa is the international honor society for two-year colleges.", "id": 3, "title": "RACC's Phi Theta Kappa Chapter Welcomes 37 New Members"},
{"body": "<p>Wednesday, March 30, 2016, Reading, PA – Initiative allows former community college students to obtain associate's degree with credits they've already earned.</p><p><strong>Harrisburg</strong> – Students who began their studies at a community college in Pennsylvania before transferring to a university within Pennsylvania's State System of Higher Education might already have earned enough credits to receive their first degree. And now there's an easy way for them to get it, through the newly launched \"reverse transfer\" initiative.</p> <p>The 14 community colleges in the state and 14 State System universities today signed a statewide reverse transfer agreement that will allow students who have earned at least 60 total credits to apply for an associate's degree from the community college where they started.</p> <p>Receiving the degree could immediately enhance the student's earning potential, even as he or she continues working toward a bachelor's degree or other certification or credential at a State System university.</p> <p>\"The State System universities and the community colleges are natural partners,\" said State System Chancellor Frank T. Brogan. \"This agreement is another example of how we can work together on behalf of students all across the Commonwealth. It's a win-win for everyone.\"</p> <p>\"Collaborating with the State System on this agreement is the next step in the commitment of Pennsylvania's community colleges to increase student completion rates to benefit both students individually and the Commonwealth as a whole,\" said Luzerne County Community College President Thomas P. Leary, who also serves as chair of the Pennsylvania Commission for Community Colleges.<br/> A student who earns an associate's degree is more likely to complete the work necessary to receive a bachelor's degree. \"If their studies toward a bachelor's degree are interrupted for any reason, with this program, they will still have their associate's degree, which will benefit them as they prepare to enter the workforce or will help enable them to move up the career ladder,\" said Elizabeth Bolden, president and CEO of the Pennsylvania Commission for Community Colleges.</p> <p>Many students who initially enroll at a community college do so with the intent of eventually earning a bachelor's degree, staying long enough to earn an associate's degree before transferring to a four-year college or university. Some leave before earning a degree, either to transfer or to go directly into the workforce.</p> <p>The Reverse Transfer Program gives those who transferred without a credential a pathway to their first college degree.</p> <p>\"Several State System universities already have reverse transfer agreements in place with their neighboring community college. This new agreement expands the program statewide, making it available to many more students across Pennsylvania,\" said Millersville University of Pennsylvania President John Anderson.</p> <p>Students who began their postsecondary education at any community college in Pennsylvania and earned a minimum of 45 credits before transferring to any State System university can participate in the new program. Eligible credits may include those earned through Prior Learning Assessment (PLA), Advanced Placement (AP), College Level Examination Program (CLEP), Credit by Exam and the military.</p> <p>A student must have enrolled at a State System university within five years of leaving the community college and have earned at least 15 additional credits at a State System university to be considered for the program. Their State System credits will be transferred back to the community college and applied to the requirements for the associate's degree.</p> <p>The State System universities will identify eligible students once they complete the 60 total credits and invite them to participate in the reverse transfer program. If interested, the eligible students will fill out a release form and their State System university transcript will be sent to the community college for review and evaluation.</p> <p>If approved, the community college will award the degree. Students will not be charged either a graduation or transcript fee by either institution involved.</p> <p>The first degrees could be awarded through the program as early as this summer. Many students likely already are eligible. Others could be once the current semester ends in May.</p> <p>\"The reverse transfer agreement is particularly helpful for students called to military service,\" said Jessica Shingara, a business management major at Millersville University and former student at Harrisburg Area Community College who spent five years in the U.S. Navy, where she was stationed aboard the USS John Paul Jones. \"Having long breaks from school can add stress to an already stressful situation, and having this program promotes an easy transition from serving to studying.\"</p> <p><strong><em>Pennsylvania's State System of Higher Education</em></strong><em> is the largest provider of undergraduate and graduate education in the Commonwealth, with about 107,000 degree-seeking students and thousands more who are enrolled in certificate and other career-development programs. Collectively, the 14 universities that comprise the State System offer more than 2,300 degree and certificate programs in more than 530 academic areas. Nearly 520,000 State System university alumni live in Pennsylvania.</em></p> <p><em>The State System universities are Bloomsburg, California, Cheyney, Clarion, East Stroudsburg, Edinboro, Indiana, Kutztown, Lock Haven, Mansfield, Millersville, Shippensburg, Slippery Rock and West Chester Universities of Pennsylvania. The universities also operate branch campuses in Oil City (Clarion), Freeport and Punxsutawney (IUP), and Clearfield (Lock Haven), and offer classes and programs at several regional centers, including the Dixon University Center in Harrisburg and in Center City in Philadelphia.</em></p> <p><em>The <strong>Pennsylvania Commission for Community Colleges </strong>is a voluntary membership association for Pennsylvania's community colleges, which collectively are the largest providers of undergraduate education in the state, serving nearly 314,000 students in 2014-15. </em></p> <p><em>Pennsylvania's community colleges are Bucks County Community College, Butler County Community College, Community College of Allegheny County, Community College of Beaver County, Community College of Philadelphia, Delaware County Community College, HACC – Central Pennsylvania's Community College,  Lehigh Carbon Community College, Luzerne County Community College, Montgomery County Community College, Northampton Community College, Pennsylvania Highlands Community College, Reading Area Community College and Westmoreland County Community College. The colleges operate 26 campuses and 84 instructional sites and centers, serving students from every county in the Commonwealth.</em></p>", "excerpt": "Wednesday, March 30, 2016, Reading, PA – Initiative allows former community college students to obtain associate's degree with credits they've already earned.", "id": 4, "title": "PA Community Colleges, State System Universities Sign Statewide 'Reverse Transfer' Agreement"},
{"body": "<p>Wednesday, March 23, 2016, Reading, PA – Reading Area Community College (RACC) in partnership with the American Social History Project/Center for Media and Learning (ASHP/CML) at Graduate Center of the City University of New York received a $100,000 National Endowment for the Humanities (NEH) grant for Conexiones: Linking Berks County Latino Communities to a Larger World, a two-year professional and curricular development program for fifteen RACC faculty members.</p><p>RACC is a Hispanic Serving Institution (HSI) defined by 31% of student population identifying as Hispanic. Conexiones will enhance RACC's existing general education courses and develop new courses with Latino-based humanities content. By integrating Latino history and culture into RACC's general education curriculum, RACC will foster greater understanding and cooperation among faculty and will use student-relevant content as a strategy for increasing academic success among Latino students. It will also augment RACC’s leadership in serving and promoting Latino scholarship in Berks County, Pennsylvania.</p> <p>Conexiones will build upon the efforts of NEH-funded Bridging Historias, which introduced 36 community college faculty, three of whom were RACC faculty, to Latino histories and cultures and provided curriculum design support. RACC faculty participants designed three Latino Studies program courses and Conexiones will bring to fruition an Associate of Arts in Latino Studies.</p> <p>For more information, please contact Jodi Corbett, RACC’s Director of Academic Partnerships, at 610-607-6219 or <a href=\"mailto:jcorbett@racc.edu\">jcorbett@racc.edu</a>.</p>", "excerpt": "Wednesday, March 23, 2016, Reading, PA – Reading Area Community College (RACC) in partnership with the American Social History Project/Center for Media and Learning (ASHP/CML) at Graduate Center of the City University of New York received a $100,000 National Endowment for the Humanities (NEH) grant for Conexiones: Linking Berks County Latino Communities to a Larger World, a two-year professional and curricular development program for fifteen RACC faculty members.", "id": 5, "title": "RACC Wins NEH Grant"},
{"body": "<p>Tuesday, March 15, 2016, Reading, PA – Reading Area Community College (RACC) is proud to announce the Third Berks Scholastic Poet Laureate and Seventh Berks County Poet Laureate Competitions.</p><p>A $500 honorarium will be awarded to the winner of the Seventh Berks County Poet Laureate and a $200 honorarium will be awarded to the winner of the Berks Scholastic Poet Laureate.</p> <p>The Berks County Poet Laureate and Berks County Scholastic Poet Laureate must be Berks County residents. The Berks Scholastic Poet Laureate must be a student attending a Berks County high school. The Sixth Poet Laureate is Nancy Yeager, with past Berks County Poet Laureates including Maria McDonnell, Craig Czury, and Heather Thomas. The Second Berks County Scholastic Poet Laureate is Alexandra Papoutsis, a graduate of Wilson High School, and the first was Sian Carter, a graduate of Governor Mifflin.</p> <p>Local poets will judge the semi-finalists and a poet of national merit will judge the finalists. <strong>Deadline to enter is May 31, 2016</strong>, and contestants will be notified by August 31, 2016.</p> <p>Contest rules and entry forms are available through the Berks County Library System, Pagoda Writer’s Group, Berks Bards, or through contacting Jodi Corbett, Director of Academic Partnerships at RACC via 610-607-6219 or <a href=\"mailto:jcorbett@racc.edu\">jcorbett@racc.edu</a></p>", "excerpt": "Tuesday, March 15, 2016, Reading, PA – Reading Area Community College (RACC) is proud to announce the Third Berks Scholastic Poet Laureate and Seventh Berks County Poet Laureate Competitions.", "id": 6, "title": "RACC Announces 2016 Berks County Poet Laureate Competitions"},
{"body": "<p>Tuesday, February 23, 2016, Reading, PA – Reading Area Community College (RACC) will host a Dual  Enrollment to Degree information session March 16, 2016 at 5:30 p.m. in the Schmidt Training and Technology Center.</p><p>RACC staff will explain the process of Dual Enrollment, a program that allows students to begin earning college credits while in high school that can be applied to an associate degree at RACC and finally lead to a bachelor's degree from one of its partner institutions. Representatives from Albright College, Alvernia University, Kutztown University, Temple University and Pennsylvania State University will also be available to participate in the discussion.</p> <p>Topics include: </p><ul> <li>How credits will transfer and apply towards a bachelor's degree</li> <li>Scholarship and other cost saving opportunities that can save students thousands of dollars</li> <li>Ideas and guidance to make the college transition easier</li> <li>Financial aid expertise and discussion of the FAFSA</li> </ul> <p>The goal of this session is to provide students and their parents with information that will allow them to save money on tuition, room and board expenses and lower the student loan/debt threshold that is prevalent across the country.</p> <p>For more information regarding this program, please contact Jodi Corbett, the Director of Academic Partnerships at 610-607-6219.</p> <p>For more information about the College, programs of study and to learn about earning college credits while in high school, please contact RACC's Admissions Office at 610-607-6224.</p>", "excerpt": "Tuesday, February 23, 2016, Reading, PA – Reading Area Community College (RACC) will host a Dual  Enrollment to Degree information session March 16, 2016 at 5:30 p.m. in the Schmidt Training and Technology Center.", "id": 7, "title": "RACC Dual Enrollment to Degree Session "},
{"body": "<p>Friday, January 22, 2016, Reading, PA – Carla Moyer and Janelle Zimmerman are Reading Area Community College’s two student nominees for the Phi Theta Kappa All-Pennsylvania Community College Academic Team.  Phi Theta Kappa is the international honor society for two-year colleges.</p><p>Moyer, an Associate Degree Nursing major from Sinking Spring, has been a Raven Ambassador, a RACCy Olympics participant, a Supplemental Instruction leader, and is involved with the Leadership Program. For the Spring 2016 semester, she is serving as the president of the Alpha Sigma Rho chapter of Phi Theta Kappa and as the treasurer of the Student Nurses Association at RACC. In the years to come, Moyer plans to continue her education to become a Certified Registered Nurse Anesthetist.</p> <p>Zimmerman, an Associate Degree Nursing major, grew up under the guidance of the Mennonite church on a dairy farm in Wisconsin. From a young age she developed leadership skills serving as a substitute parent to her siblings, since she was the oldest child. Through blending a passion for caring and learning, along with a strong work ethic and personal dedication to excellence, she has been able to excel at providing care and attention to patients under her care as a CNA at Ephrata Community Hospital, as well as at research-oriented projects.</p> <p>The All-PA Academic Team is awarded by the Pennsylvania Commission for Community Colleges and Phi Theta Kappa and serves to honor students who have excelled academically and in their community.</p> <p>The All-USA Community College Academic Team is an annual scholarship that recognizes academic excellence combined with leadership and service, which extends education beyond the classroom. Twenty students across the country are nominated to the team annually and receive a $5,000 scholarship.</p> <p>To be eligible for membership in Phi Theta Kappa, students must: </p><ul> <li>Be enrolled in a regionally accredited institution offering an associate degree program.</li> <li>Have completed at least 12 hours of coursework leading to an associate degree program.</li> <li>Generally have a grade point average of 3.6.</li> <li>Receive an invitation to membership from the chapter at the college where presently enrolled.</li> </ul> <p>For more information contact Dr. Donna Singleton, Phi Theta Kappa Advisor, at 610-372-4721, ext. 5096 or <a href=\"mailto:dsingleton@racc.edu\">dsingleton@racc.edu</a></p>", "excerpt": "Friday, January 22, 2016, Reading, PA – Carla Moyer and Janelle Zimmerman are Reading Area Community College’s two student nominees for the Phi Theta Kappa All-Pennsylvania Community College Academic Team.  Phi Theta Kappa is the international honor society for two-year colleges.", "id": 8, "title": "RACC Students Named to Phi Theta Kappa All-PA Community College Academic Team"},
{"body": "<p>Thursday, November 5, 2015, Reading, PA – Reading Area Community College (RACC) has entered into a program agreement outlining a clear pathway from an Associate of Arts in Social Work degree to a Bachelor of Social Work degree with La Salle University.</p><p>Students will benefit from taking advantage of this agreement in the following ways:</p> <ul> <li>All coursework for the AA in Social Work fulfill La Salle's BSW program requirements.</li> <li>Students can take up to 70 credits at RACC and chose from one of three pathways at La Salle: <ul style=\"list-style-type:circle\"> <li>Accelerated BSW program, which is held at the Metroplex, Plymouth Meeting, PA. Students pay the evening rate, $555 per credit.</li> <li>Full-time day program at the main campus, Philadelphia, PA. Students take 12 or more credits each semester and pay the current tuition, fees and housing, if applicable. Students are eligible for Phi Theta Kappa and transfer scholarship awards.</li> <li>Part-time evening program at the main campus, Philadelphia, PA. Students taking less than 12 credits in the evening. These students pay the evening rate $555 per credit.</li> </ul> </li> </ul> <p>Social Work is a popular program for RACC students. Danelle Bower, faculty advisor of the AA in Social Work Program, seeks BSW program agreements where students do not lose credits in the transfer process. La Salle also provides flexible delivery options to meet students' work and family lives.</p> <p>For more information, please contact Jodi Corbett at 610.607.6219 or <a href=\"mailto:jcorbett@racc.edu\">jcorbett@racc.edu</a></p>", "excerpt": "Thursday, November 5, 2015, Reading, PA – Reading Area Community College (RACC) has entered into a program agreement outlining a clear pathway from an Associate of Arts in Social Work degree to a Bachelor of Social Work degree with La Salle University.", "id": 9, "title": "RACC Signs Social Work Program Agreement with La Salle University"},
{"body": "<p>Wednesday, August 19, 2015, Reading, PA – Reading Area Community College (RACC) today entered into a partnership agreement with Bucknell University's College of Engineering, which provides a pathway through RACC's new Engineering transfer degree to Bucknell's highly selective College of Engineering.</p><p>RACC's AS in Engineering provides students with the advanced math and sciences needed for a Bachelor of Science in Engineering. RACC students who maintain a minimum 3.5 GPA for their AS in Engineering Transfer Program are eligible for admission consideration to one of Bucknell's engineering BS programs of study: Biomedical Engineering, Chemical Engineering, Civil Engineering, Computer Engineering, Computer Engineering, Computer Science &amp; Engineering, Electrical Engineering Environmental Engineering, and Mechanical Engineering. The agreement outlines fifty-four credits that will transfer to Bucknell, including credits earned through dual enrollment, ultimately making the cost of a bachelor’s degree in engineering more affordable.</p> <p>This agreement is RACC's next step to creating STEM pathways from high school to four-year colleges and universities. The AS in Engineering helps high school students who are able to successfully complete college-level course work get a running start toward their Bachelor of Science in Engineering. Many of RACC's high school dual enrollment partners offer STEM (Science, Technology, Engineering, Math) pathways. Of these STEM-focused pathways, Project Lead the Way, a K-12 STEM curriculum, is utilized at Wilson, Brandywine Heights, Twin Valley, Exeter and Oley Valley schools.</p> <p>\"RACC's affordable in-county tuition combined with RACC's $99 a credit for dual enrollment courses taught at partnership high schools may make going to Bucknell's College of Engineering an affordable reality for students who do not have the means to go directly to a top engineering school,\" said Jodi Corbett, Director of Academic Partnerships.</p> <p>For more information, please contact Jodi Corbett at 610.607.6219 or <a href=\"mailto:jcorbett@racc.edu\">jcorbett@racc.edu</a></p>", "excerpt": "Wednesday, August 19, 2015, Reading, PA – Reading Area Community College (RACC) today entered into a partnership agreement with Bucknell University's College of Engineering, which provides a pathway through RACC's new Engineering transfer degree to Bucknell's highly selective College of Engineering.", "id": 10, "title": "RACC Signs Partnership Agreement with Bucknell University"},
{"body": "<p>Wednesday, May 20, 2015 – PMMI Media Group awarded RACC's Schmidt Training and Technology Center the 2015 David A. Harvey Memorial Scholarship at the Automation Conference held May 20 in Chicago.</p><p>The David A. Harvey Memorial Scholarship was established to support future generations of automation professionals with tuition assistance, and was created in memory of the founding publisher of Automation World magazine. RACC was chosen for its work in developing programs for a variety of manufacturing segments, accessibility to students coming through multiple pathways, and working with local companies.</p> <p>Since 2006, RACC has trained, retrained, or educated more than 1,800 students in advanced manufacturing skills, working with more than 110 companies in the immediate area. RACC's Schmidt Training and Technology Center provides customized training programs that adjust to the changing needs of employers. Programs based on employer needs use evolving instruction methods and technologies that are highly individualized.</p> <p>Bonnie Spayd, RACC Executive Director of Workforce &amp; Economic Development, accepted the award.</p>", "excerpt": "Wednesday, May 20, 2015 – PMMI Media Group awarded RACC's Schmidt Training and Technology Center the 2015 David A. Harvey Memorial Scholarship at the Automation Conference held May 20 in Chicago.", "id": 11, "title": "RACC Awarded David A. Harvey Memorial Scholarship"},
{"body": "<p>Thursday, May 14, 2015, Reading, PA – Three members of the Board of Trustees— Ms. Nancy Snyder, Mr. John Woodward and Mr. James Yocum— were awarded Trustee Emeritus status at its monthly meeting last night. The board also announced the naming of the designation as the James H. Yocum Trustee Emeritus Award in recognition of his long-standing service as a trustee spanning 24 years. Ms. Snyder contributed 12 ½ years and Mr. Woodward provided 8 ½ years of service to RACC, and all three trustees conclude their terms at the end of June.</p>", "excerpt": "Thursday, May 14, 2015, Reading, PA – Three members of the Board of Trustees— Ms. Nancy Snyder, Mr. John Woodward and Mr. James Yocum— were awarded Trustee Emeritus status at its monthly meeting last night. The board also announced the naming of the designation as the James H. Yocum Trustee Emeritus Award in recognition of his long-standing service as a trustee spanning 24 years. Ms. Snyder contributed 12 ½ years and Mr. Woodward provided 8 ½ years of service to RACC, and all three trustees conclude their terms at the end of June.", "id": 12, "title": "Trustees Awarded Emeritus Status"},
{"body": "<p>Thursday, May 14, 2015, Reading, PA – Susan Looney was appointed Senior Vice President of Academic Affairs/Provost by the Board of Trustees at the monthly meeting last night after receiving the nomination from RACC President Dr. Anna Weitz following a formal search process.  Dr. Looney advances into this position as of July 1 after serving as Dean of Instruction since September.</p><p>Dr. Looney holds an Ed.D.in Educational Leadership (Nova Southeastern University), a J.D. (Widener University School of Law), as well as an M.B.A and a B.S. in Business, both from Monmouth University in New Jersey. She is no stranger to community colleges as she began her own higher education journey at Brookdale Community College in New Jersey. Before becoming the Interim Assistant VP at Colorado Mountain College, she was a Discipline Coordinator and Associate Professor of Business at that same institution. She moved to Colorado after 8 years at Delaware Technical Community College where she was a Professor in the Business Administration Department, then Assistant Campus Director; she also served as that campus' Director of Corporate and Community Programs. In addition she has been a full-time faculty member at Mohave Community College in Kingman, Arizona and an adjunct instructor at Wilmington College (DE) and Northern Arizona University. Her diverse background also includes several years as a US Army civilian employee in operations research.</p> <p>In the Senior Vice President of Academic Affairs/Provost position, Dr. Looney will oversee all the academic affairs division, as well as student affairs and advising.</p> <p>Photo available on request.</p>", "excerpt": "Thursday, May 14, 2015, Reading, PA – Susan Looney was appointed Senior Vice President of Academic Affairs/Provost by the Board of Trustees at the monthly meeting last night after receiving the nomination from RACC President Dr. Anna Weitz following a formal search process.  Dr. Looney advances into this position as of July 1 after serving as Dean of Instruction since September.", "id": 13, "title": "Dr. Looney Appointed Senior Vice President of Academic Affairs/Provost"},
{"body": "<p>Tuesday, May 5, 2015, Reading, PA – Reading Area Community College announces the Class of 2015 Academic Awards recipients, recently recognized on campus for the highest academic achievements in their programs of study.</p>", "excerpt": "Tuesday, May 5, 2015, Reading, PA – Reading Area Community College announces the Class of 2015 Academic Awards recipients, recently recognized on campus for the highest academic achievements in their programs of study.", "id": 14, "title": "Reading Area Community College announces 2015 Academic Awards Recipients"},
{"body": "<p>Reading, PA – Reading Area Community College will reduce tuition to $99 a credit for dual enrollment courses taught at partnership high schools beginning the Fall 2015 semester.</p>", "excerpt": "Reading, PA – Reading Area Community College will reduce tuition to $99 a credit for dual enrollment courses taught at partnership high schools beginning the Fall 2015 semester.", "id": 15, "title": "Reading Area Community College to Reduce Dual Enrollment Tuition to $99 a Credit"},
{"body": "<p>\nWednesday, May 6, 2015\r\n\t\t\t5:30pm – 8:00pm\r\n\t\t\tSchmidt Training and Technology Center\n</p><p>Early College Parent Night is the perfect time to talk with faculty and staff about RACC's academic programs and student support resources. Drop in any time to learn how your high school juniors and seniors can complete college courses in art, creative writing, general science and business and complete a college certificate program before graduating high school. Discover what RACC courses are conveniently offered as dual credit, only $99, at partnering high schools. Find out about summer courses, taught online and at RACC's campus, that fulfill general education requirements for RACC's associate degree programs and transfer easily to colleges and universities.</p>", "excerpt": "\nWednesday, May 6, 2015\r\n\t\t\t5:30pm – 8:00pm\r\n\t\t\tSchmidt Training and Technology Center\n", "id": 16, "title": "Early College Parent Night"},
{"body": "<p>Congratulations to RACC student Rachel Lee, who was one of 20 students nationwide named to the 2015 All-USA Community College Academic Team by the Phi Theta Kappa Honor Society.  Rachel was also honored last week in Harrisburg as a member of the All-PA Academic Team.</p><p>The All-USA honor recognizes high-achieving two-year college students who demonstrate academic excellence and intellectual rigor combined with leadership and service that extends their education beyond the classroom to benefit society. Sponsored by Follett Higher Education Group, with support from the American Association of Community Colleges, this year's winners – who must have been nominated by his or her college – were chosen from a pool of more than 1,500 students nominated by more than 800 community colleges. Rachel will receive a $2,500 scholarship for this distinction and was recognized in <i>USA Today</i>.</p> <p>Rachel is majoring in Psychology and planning to transfer to Millersville University after graduating this spring. She writes for the Front Street Journal, dances ballet, serves in youth ministry at Today's Church, works part-time, helped to charter RACC's first Psychology Honors Society (Psi Beta) and has presented research at the Beacon Conference in both 2013 and 2014. Her career goal is to earn a Ph.D. in Clinical Psychology so that she can work with adolescents who suffer from serious mental illnesses.</p> <p>Please help us congratulate Rachel on this tremendous accomplishment!</p> <p>Read the <a href=\"http://college.usatoday.com/2015/04/20/all-usa-spotlight-student-overcomes-chronic-illness-financial-hardship-to-pursue-psychology-degree/\" target=\"_blank\">USA Today article</a>.</p>", "excerpt": "Congratulations to RACC student Rachel Lee, who was one of 20 students nationwide named to the 2015 All-USA Community College Academic Team by the Phi Theta Kappa Honor Society.  Rachel was also honored last week in Harrisburg as a member of the All-PA Academic Team.", "id": 17, "title": "Congratulations to RACC student Rachel Lee"},
{"body": "<p>The Annual Health Fair is scheduled for Wednesday, April 15 from 9:00 am to 1:00 pm. The Health Fair will be held in the STTC. Students from the Division of Health Professions will be providing free information and screening services. The Health Fair is open to all RACC students, faculty and staff.</p><p>Community vendors will also be a part of the fair. Returning this year will be the East-West School of Massage. They will be offering free chair massages until 12:00 noon. Several chiropractors will be offering information about their services. Cholesterol screening will be provided by the Adventist Whole Health Network. There will be vendors for Stress Management, Hearing Screening, Glucose Testing, Blood Pressure Screening, Acupuncture and many others offering services and information to promote a healthy lifestyle.</p> <p>The Miller-Keystone Blood Center will also be at the Health Fair for a blood drive. Time slots are available between 9:00 am to 1:00 pm. To book an appointment you may register directly online by following these instructions:</p> <ol> <li>Go to the <a href=\"https://donor.giveapint.org/donor/schedules/sponsor_code\" target=\"_blank\">Miller Keystone Blood Center Sponsor Search page</a>.</li> <li>Search using Sponsor Code 3224</li> <li>Click the <strong>Schedule</strong> link for Reading Area Community College - Schmidt Training and Technology Center.</li> </ol> <p>For more information regarding the blood drive, contact Lanie Fessler at <a href=\"mailto:afessler@racc.edu\">afessler@racc.edu</a></p>", "excerpt": "The Annual Health Fair is scheduled for Wednesday, April 15 from 9:00 am to 1:00 pm. The Health Fair will be held in the STTC. Students from the Division of Health Professions will be providing free information and screening services. The Health Fair is open to all RACC students, faculty and staff.", "id": 18, "title": "Annual Health Fair and Blood Drive"},
{"body": "<p>Monday, March 23, 2015, Reading, PA – Congratulations to Reading Area Community College's 2015 Phi Theta Kappa (PTK) sponsored All-PA Academic Team nominees Rachel Lee and Cherylann McGuire.</p><p>Rachel is majoring in Psychology and planning to transfer to Millersville University after graduating this spring. She writes for the Front Street Journal, dances ballet, serves in youth ministry at Today's Church, works part-time, helped to charter RACC's first Psychology Honors Society (Psi Beta) and has presented research at the Beacon Conference in both 2013 and 2014. Her career goal is to earn a Ph.D. in Clinical Psychology so that she can work with adolescents who suffer from serious mental illnesses.</p> <p>Cherylann is majoring in Social Science and plans to earn a bachelor’s degree in History from Kutztown University. On campus she is involved in PTK, RACCy Olympics and provides supplemental instruction for her peers. She plans to develop a career in historic food customs and production and increase her volunteer efforts with the Daniel Boone Homestead and PA Heartland Herb Society, as well as become involved in community gardening projects in conjunction with the local schools.</p> <p>Nominees were selected by President Weitz and Interim Provost Dr. Stephen Waller from those students who complete the ALL-USA Common Application. The application includes two letters of recommendation, an essay, as well as information on the applicant's contribution to the College and the community.</p> <p>The nominees from the 14 Pennsylvania community colleges will be recognized at a banquet in Harrisburg on Monday, April 13.</p> <p>Thank you to Dr. Donna Singleton for her support of this prestigious opportunity for our students.</p>", "excerpt": "Monday, March 23, 2015, Reading, PA – Congratulations to Reading Area Community College's 2015 Phi Theta Kappa (PTK) sponsored All-PA Academic Team nominees Rachel Lee and Cherylann McGuire.", "id": 19, "title": "Congratulations to our 2015 All-PA Academic Team Nominees!"},
{"body": "<p>Friday, March 6, 2015, Reading, PA – Gasland director Josh Fox is bring his show, \"A Solar Home Companion\" to Reading Area Community College on March 14th at 7 p.m. Berks Gas Truth and RACC are co-hosting this free public event at the college's Schmidt Training and Technology Center.</p><p>Conceived and directed by Oscar-Nominated and Emmy-Winning filmmaker and activist Josh Fox, The Solutions Grassroots Tour: \"A Solar Home Companion\" combines classic storytelling and great music with roll-up-your sleeves organizing to look at the impacts of fossil fuel development and provide a vision for developing renewable energy like no other event on the planet.</p> <p>Lightly parodying NPR/Garrison Keillor's popular \"A Prairie Home Companion\", the show is like an old fashioned variety show, with music, stories, film sequences, and Americana but with a new twist -- this show teaches its audience how to go renewable and how to organize for a sustainable future.</p> <p>Music and Renewable Energy under one roof: In addition to Josh Fox's banjo playing, the tour will feature a musical artist at most locations as well as a renewable energy expert who can answer questions about solar, wind, and local renewable energy providers.</p> <p style=\"text-align: center;\">*******</p> <p>Parking is available at the Front and Washington Streets Garage.</p> <p>For more information, contact Drew Lapinski, RACC faculty, at <a href=\"mailto:alapinski@racc.edu\">alapinski@racc.edu</a></p>", "excerpt": "Friday, March 6, 2015, Reading, PA – Gasland director Josh Fox is bring his show, \"A Solar Home Companion\" to Reading Area Community College on March 14th at 7 p.m. Berks Gas Truth and RACC are co-hosting this free public event at the college's Schmidt Training and Technology Center.", "id": 20, "title": "Gasland director Josh Fox brings \"A Solar Home Companion\" to RACC"},
{"body": "<p>Friday, January 23, 2015, Reading, PA – Reading Area Community College graduates who intend to pursue a career in health care have a new pathway available to them via Pennsylvania College of Health Science. The presidents of both institutions signed a direct transfer agreement today during a ceremony at RACC.</p><p>\"We're pleased to be able to provide RACC students a clear path for pursuing a bachelor's degree in the health sciences field,\" said RACC President Dr. Anna D. Weitz. \"This agreement outlines how RACC's associate degree programs will blend into their bachelor's programs and give students a strong foundation for their future.\"</p> <p>\"As a premier health sciences college, our mission is to educate men and women in the continuous acquisition of knowledge in health care. A partnership with RACC through a transfer agreement positions us to continue to deliver on this mission, allowing their students to pursue continued education beyond their associate degree in our bachelor's degree programs and throughout their lifetime,\" said Pennsylvania College of Health Sciences President Dr. Mary Grace Simcox.</p> <p>RACC students who complete the associate degree programs as outlined below will be granted junior standing at the Pennsylvania College of Health Sciences in either their Bachelor of Science in Healthcare Administration or the Bachelor of Science in Health Sciences degrees.</p> <p><strong>Bachelor of Science in Healthcare Administration</strong></p> <p>Graduates of RACC's Business Administration, Health Sciences Transfer, Medical Secretary, and Electronic Health Records/Healthcare Information Technology Associate Degree programs</p> <p><strong>Bachelor of Science in Health Sciences</strong></p> <p>Graduates of RACC's Practical Nursing, Respiratory Care and Medical Laboratory Technician Associate Degree programs</p> <p>The Pennsylvania College of Health Sciences will accept up to 86 credits from RACC and all general education courses.</p>", "excerpt": "Friday, January 23, 2015, Reading, PA – Reading Area Community College graduates who intend to pursue a career in health care have a new pathway available to them via Pennsylvania College of Health Science. The presidents of both institutions signed a direct transfer agreement today during a ceremony at RACC.", "id": 21, "title": "RACC and PA College of Health Sciences Sign Transfer Agreement"},
{"body": "<p>Friday, January 9, 2015, Reading, PA – President of Reading Area Community College Dr. Anna D. Weitz offers the following statement upon conclusion of President Obama's announcement concerning his proposal to offer all citizens free community college education:</p><p>\"RACC is enthusiastic about President Obama's support for higher education, and in particular, community colleges. The President is clearly articulating what we see as a growing local awareness of the value we offer both in cost and quality. At RACC we are uniquely positioned to provide both skilled career and workforce training, as well as the first two years of college for those whose goal is to pursue a Baccalaureate or higher degree. I look forward to working with our legislative delegation on this exciting initiative in order to broaden access to education.\"</p> <p>For more information concerning the proposal, please visit <a href=\"http://www.whitehouse.gov/blog/2015/01/08/president-proposes-make-community-college-free-responsible-students-2-years\" target=\"blank\">The White House Blog.</a> A fact sheet is also available <a href=\"http://1.usa.gov/1FzlV8m\" target=\"blank\">here</a>.</p>", "excerpt": "Friday, January 9, 2015, Reading, PA – President of Reading Area Community College Dr. Anna D. Weitz offers the following statement upon conclusion of President Obama's announcement concerning his proposal to offer all citizens free community college education:", "id": 22, "title": "Statement on President Obama's Community College Proposal"},
{"body": "<p>Monday, September 15, 2014, Reading, PA – Reading Area Community College (RACC) and Kutztown University (KU) today announced a reverse transfer agreement that will permit eligible students, who transfer from RACC to KU before earning an associate degree from RACC, the opportunity to transfer KU credits back to RACC to apply towards completion of the RACC associate degree concurrent with their enrollment at KU.</p><p>\"The advantage of this agreement includes the ability for students to have a formal academic credential in hand as they continue along the path to the bachelor's degree,\" explains Dr. Anna D. Weitz, president of RACC. \"In certain career fields, this community college credential can be a benefit as students seek employment while working toward a bachelor's degree. It also provides students a sense of accomplishment by receiving a formal credential they have earned and deserve.\"</p> <p>The RACC - KU reverse transfer agreement also applies to community college credit certificates in addition to associate degrees. This is a provision that differentiates the RACC- KU agreement from others that Kutztown has in place. RACC is committed to helping students earn a variety of academic options to meet their own career and educational goals, a sign of institutional flexibility that sets RACC apart. KU has embraced RACC's creative approach to serving students and included credit certificates into this agreement.</p> <p>\"KU's partnership with RACC has been very strong through the years, and this reverse transfer agreement will strengthen our ties even more,\" said Dr. Carlos Vargas-Aburto, KU's acting president. \"Since both institutions are in Berks County, this initiative will be a benefit for many of the families and students right here in our own community.\"</p>", "excerpt": "Monday, September 15, 2014, Reading, PA – Reading Area Community College (RACC) and Kutztown University (KU) today announced a reverse transfer agreement that will permit eligible students, who transfer from RACC to KU before earning an associate degree from RACC, the opportunity to transfer KU credits back to RACC to apply towards completion of the RACC associate degree concurrent with their enrollment at KU.", "id": 23, "title": "RACC and KU Announce Reverse Transfer Agreement"},
{"body": "<p>Tuesday, June 10, 2014, Reading, PA – Three students from Reading Area Community College earned first place awards in their respective categories at the annual Beacon Conference held at SUNY Ulster in Stone Ridge, New York on June 6.</p><p>Rachel Lee captured the Psychology category for the second consecutive year with her presentation \"Understanding Deaf Psychosis: Schizophrenia's Prevalence and Manifestation in the Deaf and Hard-of-Hearing Population.\" Dr. David Brant served as her faculty mentor.</p> <div class=\"rightimage\" style=\"width: 330px;\"> <img alt=\"RACC Students Earn Wins at Beacon Conference\" height=\"220\" src=\"images/Janelle_Zimmerman_large.jpg\" width=\"330\"/> </div> <p>Sheila Frees captured the History category with her presentation \"They Did Not See It Was for Our Hurt\" that focused on Native Americans and alcoholism and was mentored by John Lawlor.</p> <p>In the Philosophy/Religion category, Janelle Zimmerman was named the winner with her paper titled \"A Compassionate Science: The Intersection of Epicurean Philosophy and Nursing Practice.\" Dr. Christopher Costello served as her faculty mentor.</p> <p>The annual Beacon Conference, open to community colleges throughout the Mid-Atlantic area, encourages students to work with faculty mentors to prepare and submit papers that demonstrate scholarship and originality. Submissions are separated into 20 different subject-area categories with three students presenting in each category.</p> <p>Criteria for judging during the conference include originality and quality of research, written work, and the oral presentation.</p>", "excerpt": "Tuesday, June 10, 2014, Reading, PA – Three students from Reading Area Community College earned first place awards in their respective categories at the annual Beacon Conference held at SUNY Ulster in Stone Ridge, New York on June 6.", "id": 24, "title": "RACC Students Earn Wins at Beacon Conference"},
{"body": "<p>Reading Area Community College recently received a $10,000 grant from Wells Fargo Bank for its Reading High School Hispanic Graduates Scholarship. This program will offer educational assistance through scholarships to Latino students in the City of Reading who otherwise might not be able to afford the costs of higher education.</p><div class=\"rightimage\" style=\"width: 300px;\"> <img alt=\"Grant received from Wells Fargo Bank\" height=\"200\" src=\"images/WellsFargoGrant.jpg\" width=\"300\"/> <div class=\"img_center center em\">L to R Maggie Kyler, North Central Regional Banking District Manager, AW &amp; Nora Sobottka, Senior Vice President, Greater PA Commercial Banking</div> </div> <p>These funds will be used to provide 10 scholarships to 10 Hispanic graduates of Reading High School who enroll as a full-time student at RACC for fall 2014. The scholarship award will help to defray the cost of tuition, books and fees.</p> <p>Scholarship recipients will be selected based on grade-point average and financial need.</p> <p>Latino/Hispanic students comprise 65% of Reading High School's population, and 90% are economically disadvantaged or low income. Recent statistics also show that only 15% of the graduates advance to post-secondary education.</p>", "excerpt": "Reading Area Community College recently received a $10,000 grant from Wells Fargo Bank for its Reading High School Hispanic Graduates Scholarship. This program will offer educational assistance through scholarships to Latino students in the City of Reading who otherwise might not be able to afford the costs of higher education.", "id": 25, "title": "RACC Receives Grant for Hispanic Graduates Scholarship"},
{"body": "<p>Bloomsburg University of Pennsylvania and Reading Area Community College Dual Admission Partnership Leads to Bachelor of Applied Science in Technical Leadership.</p><p>The agreement establishes program-to-program guaranteed admissions for students who complete the requirements for an Associate of Applied Science Degree at Reading Area Community College to enter into the Bloomsburg University of Pennsylvania Bachelor of Applied Science Degree program in Technical Leadership. Planning is currently underway to ensure that students will complete the entire degree requirements on RACC's campus or online.</p> <p>The Technical Leadership program provides the knowledge and skills necessary to assume leadership roles in work groups and project teams &amp;mash; skills necessary for career advancement in a rapidly changing, globalized workplace. The leadership focus of the program covers areas sought by employers, including:</p> <ul> <li>Effective communication and collaboration</li> <li>Team leadership and project management</li> <li>Staff training and development</li> <li>Workplace and cultural diversity</li> <li>Financial and supervisory knowledge</li> <li>Conflict management and resolution</li> </ul> <p>The agreement also extends to students of Berks Career and Technology Center and Reading Muhlenberg Career and Technology Center, and who are enrolled in the RACC-CTC Technical Academy partnership. This pathway creates a 2+2+2 articulation model that allows students to progress seamlessly from the secondary CTC, complete their community college degree and finally complete a bachelor's degree at a four-year institution.</p> <p>The intent of the partnership is:</p> <ul> <li>To demonstrate the establishment of a seamless Program-to-Program guaranteed admissions agreement that involves the participating community college and a four-year Bachelor Degree granting institution.</li> <li>To enable qualified graduates of Reading Area Community College to build upon their education and training by earning a baccalaureate degree.</li> <li>To enable Bloomsburg University to attract a more diverse population of students to the Technical Leadership program.</li> <li>To enable community college graduates to obtain a quality education at a low cost, and, in doing so, provide the Commonwealth with qualified technical leaders.</li> <li>To ensure recognition of the continuity of academic progress and transferability of credits between two-year and four-year programs.</li> </ul> <p>This is the first such partnership for Reading Area Community College that allows the opportunity for its career and technology students to earn a bachelor’s degree on its campus. The partnership extends the effort of the College to prepare a skilled and educated workforce to fill the pipeline of workers needed by area employers.</p> <p>\"Our campuses may be geographically separated by about 75 miles, but our missions to serve Pennsylvania students could not be more closely connected,\" says Bloomsburg University President David L. Soltz, Ph.D. \"I am delighted to enter into this agreement on behalf of Bloomsburg University, bringing our Bachelor of Applied Science in Technical Leadership to Reading Area Community College students who will become Bloomsburg graduates.\"</p> <p>\"Pennsylvania's community colleges and Pennsylvania State System of Higher Education universities are uniquely positioned to fulfill the training and educational requirements of employers,\" says RACC President Anna D. Weitz, D.Ed. \"This partnership with Bloomsburg University is one more example of our commitment to working together to further the economic and workforce development of our State.\"</p> <p style=\"text-align: center;\">*******</p> <p>For more information, please contact Melissa Kushner, Director of Marketing and Communications at RACC at 610.607.6212 or <a href=\"mailto:mkushner@racc.edu\">mkushner@racc.edu</a>.</p>", "excerpt": "Bloomsburg University of Pennsylvania and Reading Area Community College Dual Admission Partnership Leads to Bachelor of Applied Science in Technical Leadership.", "id": 26, "title": "RACC Signs Agreement With Bloomsburg"},
{"body": "<p>Tuesday, March 18, 2014, Reading, PA – Current students and alumni of Reading Area Community College's Leadership and Professional Development Program gathered on Tuesday, March 11 to celebrate the program's 10th anniversary. The event was held in the recently remodeled Raven’s Lounge in the Student Union Building.</p><p>The Leadership and Professional Development Program has been offering RACC students opportunities for growth and learning outside the classroom for the past ten years. The Program has evolved over the years from a few sessions to a fully developed, four-session program that includes two off-campus retreats in the spring and fall, a three-day Winter Institute and a five-day Summer Institute.</p> <p>The celebration included dinner and a short formal program around 7 p.m. Representative Thomas Caltagirone presented a citation in honor of the occasion. The event also gave attendees the opportunity to reminisce about favorite activities and traditions, and included testimonials from current students and alumni. More than 50 students attended, including dozens of alumni who are now in graduate school or successfully working in their career field.</p> <p>Current students had the opportunity to talk with alumni and learn more about furthering their education and how RACC can help them to meet their future career goals.</p> <p>Over the years, the content of the Leadership Program has varied with sessions presented by 36 faculty members, 11 community guests, six administrators, and several student workers, mentors and alumni. For example, Mayor Tom McMahon attended a session and discussed civic responsibility. Session topics have covered a wide range, from Art Appreciation to Yoga. Many of the sessions have been directly related to leadership, such as team building, servant leadership, time management and goal setting.</p> <p>In addition to the institutes, the off-campus retreats have offered a wider range of activities conducive to team building, such as creative scavenger hunts and low and high ropes courses. Students learn concepts through hands-on, active participation, without grades and tests. Some activities build community through service. For example, the students in one Winter Institute went to an Olivet Boys and Girls Club center to paint the teen room.</p> <p>Diane Marabella, RACC's now retired Dean of Student Services, launched the Leadership Program in 2003 with a series of sessions initially just open to the leaders of the campus clubs and organizations. The program slowly evolved and is now offered to all students who meet the minimum GPA of 2.5 and complete an application. Students accepted into the program receive a full scholarship for all costs of the events they attend with full engagement.</p> <p>Ten years later, there is a Leadership Team consisting of Sue Gelsinger (Student Activities Coordinator), Danelle Bower (Director of Advising &amp; Retention) and professors, Diane Hollister, Wendy Bonn and Dr. Donna Singleton, and instructor Jill Melones. The team has enjoyed the opportunity to introduce students to a host of topics and experiences which foster leadership and professional development principles in creative and fun ways.</p> <p>As the structure of the Program has grown, the benefits have also expanded. In 2013, a certification process was implemented, and, for the first time, three RACC students wore leadership cords at commencement.</p>", "excerpt": "Tuesday, March 18, 2014, Reading, PA – Current students and alumni of Reading Area Community College's Leadership and Professional Development Program gathered on Tuesday, March 11 to celebrate the program's 10th anniversary. The event was held in the recently remodeled Raven’s Lounge in the Student Union Building.", "id": 27, "title": "RACC Leadership Program Marks 10th Anniversary with Celebration, Return of Alumni"},
{"body": "<p>Monday, February 24, 2014, Reading, PA – Reading Area Community College announces a new Academic Scholarship Program, an initiative aimed at leveraging scholarships available through the Foundation for RACC to make it possible for selected RACC students to earn an associate degree at RACC without the need to take a student loan to cover tuition, books and fees.</p><p>For students considering college and their families, the future impact of college-related debt is a growing concern. This initiative seeks to educate students on avoiding unnecessary and costly student loan debt when there are more affordable and equally valuable opportunities.</p> <p>This is a selective program aimed at encouraging high school graduates who are academically prepared to excel at college-level work to choose RACC. Students selected for this program must attend full-time and commit to earning an associate degree.</p> <p>Preference will be given to:</p> <ul> <li>Students eligible for acceptance into RACC's Honors Program.</li> <li>Students admitted under one of our dual admission agreements with RACC's partner institutions - Albright College, Alvernia University, Kutztown University, Millersville University, St. Joseph's University or Temple University.</li> <li>Students enrolled in the Mechatronics, Nanoscience or Machine Tool Technology programs.</li> <li>Students whose course of study and potential to succeed uniquely adds to RACC's academic profile.</li> </ul> <p style=\"text-align: center;\">*******</p> <p>Students who wish to apply should visit our <a href=\"/FinancialAid/Scholarships/default.aspx\" target=\"_blank\">Scholarship Information page</a>. For further information, please contact Brenda Creasy, scholarship coordinator, at <a href=\"mailto:bcreasy@racc.edu\">bcreasy@racc.edu</a> or 610.372.4721, extension 5026.</p>", "excerpt": "Monday, February 24, 2014, Reading, PA – Reading Area Community College announces a new Academic Scholarship Program, an initiative aimed at leveraging scholarships available through the Foundation for RACC to make it possible for selected RACC students to earn an associate degree at RACC without the need to take a student loan to cover tuition, books and fees.", "id": 28, "title": "New Academic Scholarship Program"},
{"body": "<p>Tuesday, January 14, 2014, Reading, PA – Reading Area Community College is partnering with UGotClass to offer non-credit, online training opportunities for continuing education. UGotClass offers online certificates and courses through the Learning Resources Network, which is the largest continuing education association in the world.</p><p>Students can choose from certificate programs in business, leadership development, online teaching and numerous other subjects. In addition, UGotClass boasts special courses catering to K-12 teachers focused on topics like social media, gender in the classroom and working with students on the autism spectrum.</p> <p>Along with certificates, students can also choose UGotClass to earn CEUs, ILUs and even graduate credit. The courses are taught by leading practitioners and teachers, through the use of audio presentations, readings, video lectures and discussion all housed online at the UGotClass website.</p> <p>The greatest benefit of UGotClass is being able to take the online courses anywhere at any time once you enroll. Courses are offered four times a year. View the full list of offerings and start dates on their website <a href=\"http://www.yougotclass.org/catalog.cfm/Racc\" target=\"_blank\">here</a>.</p> <p>UGotClass is the latest offering of non-credit online courses available through RACC. The College also partners with ed2go, JER Online, CareerSmart and Gatlin. More information on all of these companies is available on our website <a href=\"/CommunityEd/online_nonCredit.aspx\" target=\"_blank\">here</a>.</p> <p style=\"text-align: center;\">*******</p> <p>For questions, please contact Ginger Bailey at <a href=\"mailto:gbailey@racc.edu\">gbailey@racc.edu</a> or 610-607-6234.</p>", "excerpt": "Tuesday, January 14, 2014, Reading, PA – Reading Area Community College is partnering with UGotClass to offer non-credit, online training opportunities for continuing education. UGotClass offers online certificates and courses through the Learning Resources Network, which is the largest continuing education association in the world.", "id": 29, "title": "RACC Introduces UGotClass for Online Continuing Education"},
{"body": "<p>Tuesday, January 7, 2014, Reading, PA – Reading Area Community College announced two tuition-free training programs are available for unemployed and underemployed Berks County residents or incumbent workers thanks to a training grant from the U.S. Department of Labor. Program options include training to become a Production Technician or a Computer Numerically Controlled (CNC) Machine Operator.</p><p>The <strong>Production Technician Certificate</strong> will serve as a credential for workers who want enter into the manufacturing sector or incumbent workers who wish to improve their skill set. The program will cover technical math, measurement, blueprint reading, mechanical fabrication, electrical fabrication, production assembly, welding, safety practices and regulations, personal protective equipment, communication skills, conflict resolution and working in groups.</p> <p>The training will span 10 weeks and include 200 hours of instruction and hands-on learning. Students must complete the program before the grant expires in September 2014. Classes will be filled on a first-come, first-serve basis.</p> <p>Students who complete this training will be qualified to advance to the next credential of Advanced Manufacturing Integrated Systems Training (AMIST) Level 1 or CNC Machine Operator. Students will also be prepared for employment as team assemblers who work in the production of durable goods, with starting wages averaging $10 - $12 per hour.</p> <p>The <strong>CNC Machine Operator Certificate</strong> will serve as an entry-level credential for students who want to enter the machining field. The program will cover print reading; precision measurement and gauging; tool identification, set-up, use and maintenance; fixture set-up and operation; and CNC mill, lathe and grinder set-up, operation, maintenance and troubleshooting.</p> <p>The CNC Machine Operator training will span 12 weeks and include 160 hours of instruction and hands-on practice. Students must complete the training before the grant expires in September 2014. Registrations will be taken weekly and training will begin the following week.</p> <p>Upon completion of this program, students will be qualified for employment as Computer-Controlled Machine Tool Operators who operate CNC machines to manufacture parts. Starting wages for these positions are between $14 and $19 per hour.</p> <p>Each training program has a minimal cost for books and consumables for incumbent workers – about $400 for Production Technician and $1,100 for CNC Machine Operator. The unemployed and underemployed may qualify for a scholarship to cover these costs based on financial need.</p> <p>Acceptance into either of these tuition-free programs requires a High School Diploma/GED and successful completion of the CareerLink WorkKeys assessment.</p> <p style=\"text-align: center;\">*******</p> <p>For more information on these training opportunities, please contact Training Program Director Bonnie Spayd (610-607-6207, <a href=\"mailto:bspayd@racc.edu\">bspayd@racc.edu</a>).</p>", "excerpt": "Tuesday, January 7, 2014, Reading, PA – Reading Area Community College announced two tuition-free training programs are available for unemployed and underemployed Berks County residents or incumbent workers thanks to a training grant from the U.S. Department of Labor. Program options include training to become a Production Technician or a Computer Numerically Controlled (CNC) Machine Operator.", "id": 30, "title": "RACC Announces Tuition-Free Advanced Manufacturing Training Opportunities"},
{"body": "<p>Reading Area Community College lost a true friend, benefactor and founder with the passing of Mary Ann Chelius Smith on July 20, 2013. Mary Ann played a prominent role in the founding of RACC.</p>", "excerpt": "Reading Area Community College lost a true friend, benefactor and founder with the passing of Mary Ann Chelius Smith on July 20, 2013. Mary Ann played a prominent role in the founding of RACC.", "id": 31, "title": "In Memory of Mary Ann Chelius Smith"},
{"body": "<p>Thursday, May 9, 2013, Reading, PA – Students, faculty and staff from Reading Area Community College worked together to raise more than $16,000 for the Olivet Boys and Girls Club during this year's RACCy Olympics.</p><p>RACC recently presented the check to Olivet staff and members at the end of the fundraising campaign's culminating event. Judd Meinhart, Program and Grants Administrator at Olivet, said the funds will go toward supporting the summer camp program that more than 800 area youth participate in, more than half of which will attend for free, because of donations.</p> <p>\"During the summer, our campers participate in a variety of activities including swimming, arts and crafts, field trips and recreational games,\" said Meinhart. \"We also engage our members in educational and character building activities to combat the summer learning loss that so many inner-city youth experience.</p> <p>\"Campers get the true camp experience once a week when they take a trip to Blue Mountain Camp in Hamburg for some old school camp fun like fishing, boating and exploring nature,\" Meinhart added.</p> <p>RACC raised the money through car washes, roller skating parties, yard sales and candy bar sales. The top individual fundraiser was student Alex Breidegam who raised $844.79, thanks in large part to selling more than 20 boxes of candy. The highest fundraising team was People That Kare, comprised of Phi Theta Kappa honor society students, raising $4,355.50.</p> <p>For more information, please contact Kim Uphold, Coordinator of Student Activities at <a href=\"mailto:kuphold@racc.edu\">kuphold@racc.edu</a> or 610-236-3943.</p>", "excerpt": "Thursday, May 9, 2013, Reading, PA – Students, faculty and staff from Reading Area Community College worked together to raise more than $16,000 for the Olivet Boys and Girls Club during this year's RACCy Olympics.", "id": 32, "title": "RACC Presents $16,000 Check to Olivet Boys and Girls Club"},
{"body": "<p>Monday, March 18, 2013, Reading, PA – Reading Area Community College is pleased to announce that Elise Chesson and Christopher King have been named to the All-Pennsylvania Academic Team, which is part of the All-USA Academic Team competition sponsored by USA Today.</p><p>Chesson and King were honored for their academic achievements in the classroom and for their volunteerism in their communities.</p> <p>As part of the academic team honor, both students will receive a scholarship from the Pennsylvania State System of Higher Education (PASSHE) that can be applied at any of the 14 universities within the PASSHE system. The program requires that students apply to the university within one year, and the scholarship is renewable for two years toward a baccalaureate degree at that university.</p> <p>In addition, King has been recognized as a 2013 Coca-Cola Community College Academic Team Silver Scholar. The Coca-Cola Scholars Foundation sponsors the Coca-Cola Community College Academic Team program by recognizing 50 Gold, 50 Silver and 50 Bronze Scholars, and providing nearly $200,000 in scholarships annually. Each Silver Scholar receives a $1,250 scholarship and a special medallion.</p> <p>Chesson, a member of Phi Theta Kappa, is actively involved with her daughters’ elementary school and extracurricular activities. She has volunteered with Organizing for America during the past two presidential elections, and helped plant trees in conjunction with the Berks Conservancy and PA Fish &amp; Boat Commission.</p> <p>Chesson will graduate in May with a degree in Cultural Anthropology. She is planning to transfer to West Chester University for a bachelor’s degree in Political Science with a focus on International Relations, and eventually continue on for a Master’s Degree in Public Administration.</p> <p>King is the Public Relations Officer for Phi Theta Kappa and has helped the club with its book drives and book donation to the Olivet Boys and Girls Club. Locally, King volunteers at the Robesonia Community Pool and works at the Ephrata Public Library.</p> <p>King will graduate with a degree in Education and plans to enroll at Millersville University to pursue a bachelor’s degree in Secondary Education/English.</p>", "excerpt": "Monday, March 18, 2013, Reading, PA – Reading Area Community College is pleased to announce that Elise Chesson and Christopher King have been named to the All-Pennsylvania Academic Team, which is part of the All-USA Academic Team competition sponsored by USA Today.", "id": 33, "title": "RACC Students Receive All-PA Academic Team Honors, Earn Scholarships"},
{"body": "<p>Monday, October 22, 2012, Reading, PA – Three students from Reading Area Community College recently received individual awards from the Columbia Scholastic Press Association (CSPA) for their work on Voices of Legacy, the 2012 edition of RACC's scholarly journal, Legacy.</p><p>Alexandra Fotache's photography \"Bubbles\" captured second place in the photography category, while William Wood received third place for his work of fiction entitled \"Childhood Odyssey.\"</p> <p>Michael O'Donahue, who graphically designed the journal received two awards: third place for general use of typography and a certificate of merit for literary multi-page presentation. The staff of Voices of Legacy also received a certificate of merit for overall design.</p> <p>Additional students on the staff include Amy Belnome, Daniel Smyk, Michele Granitz, Rafael Nunez-Castaneda and Matthew Risell.</p> <p>Along with the individual awards, Voices of Legacy earned gold medal standing from the CSPA, and has been named a finalist in the national Associated Collegiate Press Magazine Pacemaker Awards. The journal also placed second in the Literary Magazine Competition of the Community College Humanities Association's Eastern Division.</p> <p>Each year, RACC students submit original creative poems, photography, art and other works for publication in Legacy. The publication is run completely by students, including the editors and overseen by a faculty member. Dr. Bahar Diken served as the 2012 advisor.</p> <p>Voices of Legacy can be viewed on <a href=\"/StudentLife/Clubs/Legacy/archive.aspx\">RACC's website</a>.</p>", "excerpt": "Monday, October 22, 2012, Reading, PA – Three students from Reading Area Community College recently received individual awards from the Columbia Scholastic Press Association (CSPA) for their work on Voices of Legacy, the 2012 edition of RACC's scholarly journal, Legacy.", "id": 34, "title": "RACC Students Earn Awards for Scholarly Works"},
{"body": "<p>Wednesday, October 3, 2012, Harrisburg, PA – New program will train underemployed, unemployed Pennsylvanians, help place them into high-demand jobs.</p>", "excerpt": "Wednesday, October 3, 2012, Harrisburg, PA – New program will train underemployed, unemployed Pennsylvanians, help place them into high-demand jobs.", "id": 35, "title": "Community Colleges Launch Rapid Retraining Program for Pennsylvania's Displaced Workers"}
]